#################################################	
#              Макрос дескриптора               #
#################################################	

.macro .descriptor, limit=0,base=0,g=0,x=0,l=0,p=0,dpl=0,c=0,r,a=0,w,ed=0,type
	.if (\limit)<=0x00100000
		.word (\limit)%0x10000
	.else
		.word ((\limit)/4096)%0x10000
	.endif
		.word (\base)%0x10000
		.byte ((\base)>>16)%0x0100
	.ifnb \type
		.byte ((\p)<<7)+((\dpl)<<5)+(\type)
	.else
		.ifnb \r
			.byte ((\p)<<7)+((\dpl)<<5)+0b11000+((\c)<<2)+((\r)<<1)+(\a)
		.else
			.ifnb \w
				.byte ((\p)<<7)+((\dpl)<<5)+0b10000+((\ed)<<2)+((\w)<<1)+(\a)
			.else
				.byte 0
			.endif
		.endif
	.endif
	.if (\limit) <=0x00100000
		.byte ((\g)<<7)+((\x)<<6)+((\l)<<5)+((\limit)>>16)%0x10
	.else
		.byte 0b10000000+((\x)<<6)+((\l)<<5)+(((\limit)>>28)%0x10)
	.endif
		.byte ((\base)>>24)%0x0100
.endm


#################################################	
#         Макрос дескриптора прерывания         #
#################################################	

.macro .gate32, offset=0, selector=(CS_dsc - GDT), p=1, dpl=0
	.word	\offset			# Младшие два байта 32-х битного поля Offset. Поле Offset содержит смещение обработчика прерывания.
	.word	\selector		# Селектор сегмента, содержащего обработчик прерывания.
	.byte	0				# Эта часть дескриптора не используется.
	.byte	((\p) << 7) + ((\dpl) << 5) + 14 # Флаги
	.word	0				# Старшие два байта поля Offset.
.endm


#################################################	
#          Макрос дескриптора ловушки           #
#################################################

.macro .trap32, offset=0, selector=(CS_dsc - GDT), p=1, dpl=0
	.word	\offset			# Младшие два байта 32-х битного поля Offset. Поле Offset содержит смещение обработчика прерывания.
	.word	\selector		# Селектор сегмента, содержащего обработчик прерывания.
	.byte	0				# Эта часть дескриптора не используется.
	.byte	((\p) << 7) + ((\dpl) << 5) + 15 # Флаги
	.word	0				# Старшие два байта поля Offset.
.endm


/*
0b0101	 0x5	 5	 80386 32 bit Task gate
0b0110	 0x6	 6	 80286 16-bit interrupt gate
0b0111	 0x7	 7	 80286 16-bit trap gate
0b1110	 0xE	 14	 80386 32-bit interrupt gate
0b1111	 0xF	 15	 80386 32-bit trap gate

http://wiki.osdev.org/Interrupt_Descriptor_Table
*/
